#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-W9esu8X711QsVWxX

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_cluster.openarabic: Reading...
digitalocean_container_registry.repository: Refreshing state... [id=openarabic]
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=77075ba0-95ba-4b48-af02-749d1566c548]
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 0s [id=77075ba0-95ba-4b48-af02-749d1566c548]
module.helm_charts.helm_release.istio-base: Refreshing state... [id=istio-base]
module.helm_charts.helm_release.loadtester: Refreshing state... [id=loadtester]
module.helm_charts.helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
module.helm_charts.helm_release.metrics-server: Refreshing state... [id=metrics-server]
module.helm_charts.helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
module.helm_charts.helm_release.flagger: Refreshing state... [id=flagger]
kubernetes_namespace.loadtester: Refreshing state... [id=loadtester]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.helm_charts.helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "loki-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.6.5"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "grafana.enabled"
          + value = "true"
        }
      + set {
          + name  = "grafana.persistence.enabled"
          + value = "true"
        }
      + set {
          + name  = "grafana.persistence.size"
          + value = "5Gi"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*